Repository: 84000/data-translation-memory
Catalog: toh346-v3.tmx
Source language: bo
Languages: en

source: མ་ག་དྷཱ་བཟང་མོའི་རྟོགས་པ་བརྗོད་པ།
en: The Exemplary Tale of Sumāgadhā

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་བཞུགས་ཏེ།
en: The blessed Buddha was dwelling in Śrāvastī, in Prince Jeta’s Grove, Anāthapiṇḍada’s Park.

source: དེ་ནས་དེའི་ཚེ་མཉན་ཡོད་ན་མགོན་མེད་ཟས་སྦྱིན་གྱི་བུ་མོ་མ་ག་དྷཱ་བཟང་མོ་ཞེས་བྱ་བ་དད་པ་དང་ལྡན་པ། རང་བཞིན་བཟང་བ། བསམ་པ་དགེ་བ། བདག་དང་གཞན་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་ཞིག་གནས་སོ། །
en: At that time, a daughter of Anāthapiṇḍada known as Sumāgadhā, who was faithful, good-natured, virtuous in her thoughts, and engaged in benefiting herself and others, was dwelling in Śrāvastī.

source: ཇི་ཙམ་ན་བུ་རམ་ཤིང་འཕེལ་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་ན་ཚོང་དཔོན་གཞན་ཞིག་གནས་པ་ལ། དེའི་བུ་ཁྱུ་མཆོག་བྱིན་ཞེས་བྱའོ། །
en: Meanwhile, in a city known as Puṇḍravardhana, there lived another merchant, whose son was known as Vṛṣabhadatta.

source: དེ་ཡང་གཞན་མུ་སྟེགས་པ་སྟེན་པས་གཅེར་བུ་པ་རྣམས་ལ་མངོན་པར་དད་པ་ཞིག་གནས་པ་དང་།
en: By associating with the heterodox non-Buddhists, he had come to believe in the nirgranthas.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོ་འཕྲུལ་ཆེན་པོ་རྣམ་པར་བསྟན་པ་དེའི་ཚེ་མུ་སྟེགས་པ་རྣམས་མཐའ་འཁོབ་ཏུ་ཀུན་དུ་གནས་ཏེ། ལ་ལ་ནི་གྲོང་ཁྱེར་བཟང་བྱེད་ཅེས་བྱ་བ་ནའོ། །ལ་ལ་ནི་མུད་གི་རི་ཀ་ཞེས་བྱ་བའི་ཡུལ་ནའོ། །ལ་ལ་ནི་བུ་རམ་ཤིང་འཕེལ་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་ན་གནས་སོ། །
en: Whenever the Blessed One performed miraculous displays, the non-Buddhists would remain in the outlying districts—some in the city called Bhadrika, some in the area known as Mudgirika, and some in the city known as Puṇḍravardhana.

source: དེའི་ཚེ་དེའི་དུས་ན་ཁྱུ་མཆོག་བྱིན་དེའི་བར་དུ་ཁྱིམ་མ་བྱས་པ་དང་།
en: At that time, Vṛṣabhadatta had not yet established a household.

source: དེ་ལ་གཅེར་བུ་པ་རྣམས་ཀྱིས་སྨྲས་པ། མགོན་མེད་ཟས་སྦྱིན་གྱི་བུ་མོ་མ་ག་དྷཱ་བཟང་མོ་ཞེས་བྱ་བ་གཟུགས་བཟང་བ། བལྟ་ན་སྡུག་པ། མཛེས་པ། སྐྱེ་བོ་དམ་པ་རྣམས་དང་འདྲ་བ་ཞིག་ཡོད་དོ། །
en: Concerning that, the nirgranthas said, “There is a daughter of Anāthapiṇḍada called Sumāgadhā, who is beautiful, pleasing to behold, and graceful, the most beautiful woman in the land.”

source: ཇི་སྲིད་དེས་ཐོས་པ་དང་བདག་ཉིད་གཅེར་བུ་པའི་ཆ་བྱད་དུ་བྱས་ཏེ་མཉན་ཡོད་དུ་སོང་ངོ་། །
en: As soon as he heard that, Vṛṣabhadatta assumed the guise of a nirgrantha mendicant and traveled to Śrāvastī.

source: ཇི་ཙམ་ན་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཁྱིམ་དུ་སློང་བའི་ཕྱིར་ཞུགས་པ་དང་། དེས་བུ་མོ་དེ་མཐོང་ངོ་། །
en: He entered the home of the householder Anāthapiṇḍada to collect alms, and there he saw the girl.

source: མཐོང་བའི་མོད་ཁོ་ན་ལ་བུ་མོ་དེ་ལ་ཀུན་དུ་ཆགས་པར་གྱུར་ལ། དེ་དེར་བསླངས་པའི་ཚེ་ཞྭའི་ནང་དུ་བླངས་སོ། །
en: He was enamored the moment he saw her, and when he received the alms, he took them in his hat.

source: དེ་ནས་བུ་མོ་དེས་ལོག་པར་སྤྱོད་པ་དེ་མཐོང་བ་དང་། འདི་ནི་ཤེས་བཞིན་མེད་པར་སློངས་མོ་ལེན་ཏོ་ཞེས་བགད་དོ། །
en: The girl saw his improper behavior and laughingly said, “This one is absentmindedly accepting alms!”

source: དེ་ནས་ཁྱུ་མཆོག་བྱིན་དེ་ངོ་ཚ་བར་གྱུར་པ་དང་།
en: Vṛṣabhadatta was ashamed and returned to the city of Puṇḍravardhana.

source: བུ་རམ་ཤིང་འཕེལ་གྱི་གྲོང་ཁྱེར་དུ་སོང་སྟེ་ཕ་ལ་སྨྲས་ནས་དེས་བུ་མོ་དེ་བླངས་སོ། །
en: There he spoke to his father, who accepted the girl.

source: མགོན་མེད་ཟས་སྦྱིན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞན་དུ་ན་གང་གི་ཚེ་མ་ག་དྷཱ་བཟང་མོ་འདི་བུ་རམ་ཤིང་འཕེལ་དུ་སོང་ན་རབ་ཏུ་བྱུང་བ་རྣམས་ཀྱི་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་པར་འགྱུར་རོ། །
en: Anāthapiṇḍada asked the Blessed One about this, and the Blessed One replied, “Actually, if Sumāgadhā goes to Puṇḍravardhana, she will perform the activity of renunciants and the activity of a buddha.”

source: ཡང་ཇི་སྲིད་ཅིག་ན་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་ཉེ་དུ་རྣམས་ལ་ཡང་གོ་བར་བྱས་ནས་བྱིན་པ་དང་བུ་རམ་ཤིང་འཕེལ་དུ་ཁྱེར་རོ། །
en: So the householder Anāthapiṇḍada informed her relatives and she was betrothed and conveyed to the city of Puṇḍravardhana.

source: ཇི་ཙམ་ན་དུས་གཞན་ཞིག་གི་ཚེ་ཁྱིམ་དེ་ན་གཅེར་བུ་པ་རྣམས་ཟན་ཟ་བ་དང་། དེ་ལ་སྒྱུག་མོས་སྨྲས་པ། དེ་རིང་བདག་ཅག་གི་ཁྱིམ་ན་མཆོད་གནས་རྣམས་བཤོས་གསོལ་གྱིས་ཚུར་ཤོག །
en: Shortly thereafter, when the nirgranthas were eating at home, Sumāgadhā’s mother-in-law said, “Today, the venerable ones will come to our home for an offering of food.

source: མཆོད་གནས་རྣམས་ལ་ལྟོས་ཤིག །
en: Come and see the venerable ones.”

source: མ་ག་དྷཱ་བཟང་མོས་དེ་ཐོས་པ་དང་དགའ་བ་དང་། མགུ་བ་དང་། རངས་པ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ་བསམས་པ།
en: On hearing this Sumāgadhā was happy, pleased, gladdened, and cheered.

source: ངེས་པར་བཙུན་པ་ཤཱ་རིའི་བུའམ། མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་སོགས་པ་ཉན་ཐོས་ཆེན་པོ་རྣམས་བྱོན་པར་གྱུར་ཏོ་སྙམ་ནས་དེ་ཡིད་རབ་ཏུ་དགའ་བ་དང་།
en: Thinking, “Surely it is the reverend Śāriputra, Mahāmaudgalyāyana, and the other great śrāvakas who have come!”

source: འཇིགས་པ་མེད་པར་སོང་བ་དང་།
en: she was greatly pleased and went without hesitation.

source: གཅེར་བུ་ནགས་ཀྱི་མ་ཧེ་འདྲ་བ། སྐྲ་རྣམས་བཏོགས་པ། ཕུག་རོན་གྱི་ཕྲུ་གུ་འདྲ་བའི་གཅེར་བུ་པ་རྣམས་མཐོང་ངོ་། །མཐོང་བ་དང་དེའི་མོད་ལ་མ་ག་དྷཱ་བཟང་མོ་ངོ་ཚ་སྟེ། དེ་གདོང་གཞན་དུ་བལྟས་པ་དང་།
en: But as soon as she saw the nirgranthas, who were like naked wild buffalo, with plucked hair like pigeon squabs, Sumāgadhā was embarrassed and averted her face.

source: དེ་ལ་སྒྱུག་མོ་དེས་སྨྲས་པ། བུ་མོ་ཁྱོད་ཅིའི་ཕྱིར་ཡི་མུག་པར་གྱུར། དེས་སྨྲས་པ།
en: Her mother-in-law asked, “Daughter, why are you displeased?”

source: གང་འདི་ལྟ་བུ་མཆོད་གནས་ཡིན་ན་མཆོད་གནས་མ་ཡིན་པ་གོ་ཇི་ལྟ་བུ་ཞིག་ཡོད་པར་འགྱུར། དེ་ལ་དེས་སྨྲས་པ།
en: She replied, “If ones such as these are objects of veneration, who would not be considered a venerable one?”

source: བུ་མོ་ཁྱོད་ལ་འདི་བས་ཆེས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་འགའ་ཞིག་ཡོད་དམ་བུ་མོས་སྨྲས་པ་བདག་གི་ཕའི་གཙུག་ལག་ཁང་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་སངས་རྒྱས་ཞེས་བྱ་བའི་སྟོན་པ་བཞུགས་ཏེ།
en: Her mother-in-law asked her, “Do you have teachers who are superior to these?” The girl replied, “In my father’s monastery, Prince Jeta’s Grove, there is a teacher known as the Buddha.

source: དེ་ནི་རྒྱུ་བ་དང་། མི་རྒྱུ་བའི་འཇིག་རྟེན་གྱི་མཆོད་གནས་ཡིན་ནོ། །
en: He is the object of veneration of the entire animate and inanimate world.”

source: ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཇི་འདྲ་བ་ཞིག །
en: “What is your teacher like?”

source: སྨྲས་པ།
en: she asked.

source: བདག་གི་སྟོན་པ་བཙོ་མའི་ཚོགས་ལྟར་སེར། །བཙོ་མའི་གསེར་ལྟར་ཤིན་ཏུ་དྲི་མ་མེད། །
en: The girl replied: “My teacher is golden like a heap of campaka flowers, Stainless like refined gold.

source: ཚུལ་ཁྲིམས་རྣམ་དག་ཤེས་རབ་ཤིན་ཏུ་དག །འཇིག་རྟེན་གསུམ་ན་མཉམ་མེད་འགྲོ་ལས་འཕགས། །
en: His discipline pure, his wisdom spotless, He is unequaled in the three worlds, the supreme among beings.”

source: དེ་ཐོས་མ་ཐག་ཏུ་སེམས་རབ་ཏུ་དགའ་བར་གྱུར་ནས་སྨྲས་པ། བུ་མོ་ངེད་ཅག་རྣམས་ལ་བཅོམ་ལྡན་འདས་དེ་སང་བསྟན་པར་ནུས་སམ། མ་ག་དྷཱ་བཟང་མོས་སྨྲས་པ།
en: Upon hearing this, her mother-in-law was overjoyed, and she asked, “Daughter, can you show us that Blessed One tomorrow?”

source: བཤོས་གཙང་རྣམས་སྦྱོར་ཅིག་དང་། སང་བཅོམ་ལྡན་འདས་སྤྱན་དྲང་བར་བྱའོ། །
en: Sumāgadhā replied, “Prepare offerings of food, and tomorrow I will invite the Blessed One.”

source: ཇི་ཙམ་ན་དེ་རྣམས་ཀྱིས་སྨྲས་པ། བཤོས་གཙང་རྣམས་སྦྱར་གྱིས་ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་སང་སྤྱན་དྲོངས་ཤིག །
en: Sometime later they said, “The offerings of food have been prepared, so you should invite the Blessed One tomorrow.”

source: དེ་ནས་མ་ག་དྷཱ་བཟང་མོས་ཁང་པའི་ཡང་ཏོག་གི་སྟེང་དུ་མངོན་པར་འཛེགས་ནས་ཕྱོགས་གང་ན་བཅོམ་ལྡན་འདས་བཞུགས་པའི་ཕྱོགས་དེར་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཡོན་ཏན་རྗེས་སུ་དྲན་ཏེ།
en: Then Sumāgadhā climbed to the very top of the house. She folded her hands and paid homage in the direction of the Blessed One, recalled the good qualities of the Blessed One, and strewed flowers and made offerings of incense.

source: མེ་ཏོག་རྣམས་གཏོར་ཅིང་སྤོས་ཀྱང་བཏུལ་ནས་གསེར་གྱི་བུམ་པའི་ཆུས་བཅོམ་ལྡན་འདས་སྤྱན་དྲང་བའི་ཕྱིར་གསེར་གྱི་བུམ་པའི་ཆུ་ཡང་སྦྲེངས་སོ། །
en: In order to invite the Blessed One, she sprinkled water from a golden vase.

source: སྙིང་རྗེ་བའི་ཚིག་འདི་སྐད་ཅེས་ཀྱང་སྨྲ་སྟེ། བཅོམ་ལྡན་འདས་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ། བདག་ནི་རི་དགས་དང་འདྲ་བར་གྱུར་ཅིང་མཐའ་འཁོབ་ན་མཆིས་ཏེ།
en: Then she spoke these piteous words: “O Blessed One possessed of great compassion, like a wild animal I have come to this frontier, separated from the Three Jewels.

source: དཀོན་མཆོག་གསུམ་དང་བྲལ་བར་གྱུར་པ་ལ་རྗེས་སུ་གཟུང་བར་མཛད་ཅིང་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་འདིར་གཤེགས་པར་མཛད་དུ་གསོལ། ཡང་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་ཏེ།
en: Please care for me, and with your saṅgha of monks please come to this place!”

source: ཚུལ་ཁྲིམས་རྣམ་དག་ཤེས་རབ་ཤིན་ཏུ་དག །དད་ལྡན་སྙིང་པོ་ཉན་ཐོས་ཆེ་རྣམས་ཀྱིས། །མགོན་མེད་གྱུར་པ་བདག་ལ་རྗེས་གཟུང་བའི། །དོན་མཛད་ཐུགས་རྗེས་གཤེགས་པར་མཛད་དུ་གསོལ། །
en: And she spoke these words: “Your discipline pure, your wisdom spotless, Great śrāvakas with faithful hearts, Please care for me—I who am without a protector— And out of compassion come to this place.”

source: ཇི་ཙམ་ན་མེ་ཏོག་དང་སྤོས་དང་གསེར་གྱི་བུམ་པའི་ཆུའང་ནམ་མཁའ་ལ་འཕགས་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱང་དེའི་ཚེ་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་འཁོར་རྣམ་བཞི་ལ་ཆོས་སྟོན་ཏོ། །
en: Just then the flowers, incense, and water from the golden vase rose into the sky, and at that moment the Blessed One arose from his deep absorption and taught the Dharma to the fourfold assembly.

source: གསེར་གྱི་བུམ་པའི་ཆུ་དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཻ་དཱུརྱའི་སྡོང་བུ་བཞིན་དུ་རྣམ་པར་གནས་སོ། །མེ་ཏོག་དེ་བཅོམ་ལྡན་འདས་ཀྱི་སྟེང་གི་ནམ་མཁའ་ལ་ཁང་པ་བརྩེགས་པ་བཞིན་དུ་གནས་སོ། །དྲི་ངད་སྤོས་ཀྱང་སྤྲིན་བརྩེགས་པ་བཞིན་དུ་གནས་པར་གྱུར་ཏོ། །
en: The water from the golden vase came to rest before the Blessed One like a staff of beryl, the flowers rested like a pinnacled temple in the sky above the Blessed One, and the fragrant incense came to rest like heaps of clouds.

source: དེ་ནས་དེ་མཐོང་བ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཅོམ་ལྡན་འདས་སྤྱན་འདྲེན་པ་འདི་ག་ལས་མཆིས།
en: Seeing this, the venerable Ānanda inquired of the Blessed One, “Blessed One, from whence does this invitation come?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དཔག་ཚད་བརྒྱ་དྲུག་ཅུ་རྩ་གསུམ་ན། བུ་རམ་ཤིང་འཕེལ་གྱི་གྲོང་ཁྱེར་ཡོད་པ་ནས་འོངས་སོ། །
en: The Blessed One replied, “Ānanda, it came 163 yojanas from the city of Puṇḍravardhana.

source: ཀུན་དགའ་བོ་གྲོང་ཁྱེར་དེ་ནི་མུ་སྟེགས་པ་རྣམས་ཀྱིས་བཟུང་བ་ཡིན་པས་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པས་འགྲོ་བར་བྱའོ་ཞེས་དགེ་སློང་རྣམས་ལ་ཚུལ་ཤིང་བྲིམས་ཤིག །
en: Ānanda, as that city is held by non-Buddhists, we must go there with an extraordinary display of miraculous power. Therefore, distribute the tally sticks to the monks.”

source: ཇི་ཙམ་ན་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རྒན་པའི་གནས་མཐའ་ནས་བཟུང་ནས་ཚུལ་ཤིང་བྲིམས་ཏེ།
en: Right away, the venerable Ānanda distributed the tally sticks, starting with the most senior monk.

source: འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །སང་བུ་རམ་ཤིང་འཕེལ་གྱི་གྲོང་ཁྱེར་དུ་འགྲོ་བར་བྱ་སྟེ།
en: He said, “Tomorrow we will go to the city of Puṇḍravardhana.

source: གྲོང་ཁྱེར་དེ་ནི་མུ་སྟེགས་པ་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བས་ཁྱོད་ཅག་རྣམས་ལས་གང་རྫུ་འཕྲུལ་ཐོབ་པ་དེས་ཚུལ་ཤིང་ལོང་ཤིག །
en: As that city is completely held by non-Buddhists, those among you who have attained miraculous power must take these tally sticks.”

source: ཇི་སྲིད་ཅིག་ན་རྒན་པའི་མཐའ་ནས་ཚུལ་ཤིང་ལེན་པར་བརྩམས་སོ། །
en: Then the process of taking the tally sticks began, starting with the most senior monk.

source: ཡང་དེ་ན་གནས་བརྟན་གང་པོ་ཞེས་བྱ་བ་ཡོད་དེ་དེ་ཡང་རྫུ་འཕྲུལ་མ་ཐོབ་པར་ལག་པ་བརྐྱང་སྟེ་ཚུལ་ཤིང་ལེན་པར་བརྩམས་པ་དང་།
en: Among them was the elder known as Pūrṇa. Although he had not attained miraculous power, he reached out his hand to take a tally stick.

source: དེ་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ། གནས་བརྟན་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཁྱིམ་དུ་འཇུག་པ་མ་ཡིན་གྱི། གཞན་དུ་དཔག་ཚད་བརྒྱ་དྲུག་ཅུ་རྩ་གསུམ་ན། བུ་རམ་ཤིང་འཕེལ་ཞེས་བྱ་བའི་གནས་ཡོད་དེ། དེར་འགྲོ་དགོས་སོ། །
en: The venerable Ānanda said to him, “Elder, we are not going to the home of Anāthapiṇḍada, but we must travel to a place 163 yojanas from here known as Puṇḍravardhana.”

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ངས་ནི་ཐོག་མ་མེད་པའི་དུས་ནས་གོམས་པའི་ཉོན་མོངས་པ་ནི་སྤངས་ན།
en: The elder thought, “I have abandoned the defilements to which I had been habituated since beginningless time, so what could be difficult about such miraculous power, which is common even to non-Buddhists?

source: མུ་སྟེགས་པ་རྣམས་དང་ཐུན་མོང་དུ་གྱུར་པའི་རྫུ་འཕྲུལ་ལྟ་ཞིག་དཀའ་བ་ཇི་ཞིག་ཡོད་ནས་བསྐྱེད་པར་མི་བྱ་སྙམ་ནས་དེས་ཀྱང་དུས་དེ་ཉིད་དུ་རྫུ་འཕྲུལ་བསྐྱེད་པ་དང་།
en: I will not produce it.” Due to that thought, however, at that very moment the miraculous power was produced.

source: ཇི་སྲིད་དུ་ཚུལ་ཤིང་གཉིས་པ་མ་བྲིམས་པ་དེ་སྲིད་དུ་དེས་གླང་པོ་ཆེའི་སྣ་འདྲ་བའི་ལག་པ་བརྐྱང་སྟེ་ཚུལ་ཤིང་བླངས་སོ། །
en: As the second tally stick had not yet been distributed, the elder reached out his hand like an elephant’s trunk and took the tally stick.

source: ཇི་ཙམ་ན་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རྒན་པའི་མཐའ་ལོགས་སུ་འདུག་སྟེ་སྨྲས་པ། གང་གིས་རྫུ་འཕྲུལ་གང་ཐོབ་པ་དེས་བུ་རམ་ཤིང་འཕེལ་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་དུ་འགྲོ་བར་བྱའོ། །
en: Meanwhile, Venerable Ānanda, sitting at the head of the elders, said, “Those who have attained miraculous power must go to the city of Puṇḍravardhana.”

source: དེ་ནས་ཉི་མ་གཉིས་པ་ལ་ནམ་ནངས་ཏེ་དགེ་སློང་རྣམས་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པས་ཡང་དག་པར་ཆས་སོ། །
en: Then on the second day, at daybreak, the monks prepared by perfecting their displays of miraculous power.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ཡང་མཉན་ཡོད་གང་ན་བ་དེར་མངོན་པར་བལྟ་བར་བརྩམས་སོ། །
en: The Four Great Kings also set out in the direction of Śrāvastī.

source: ཇི་ཙམ་ན་བར་སྐབས་དེར་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་ཞེས་བྱ་བ་རྟའི་ཤིང་རྟ་ལ་ཞོན་ཏེ་གློག་འགྱུ་བའི་སྣང་བ་སྟོན་ཅིང་དལ་བུ་དལ་བུས་ཆར་རབ་ཏུ་འབེབས་ཏེ།
en: As they did so, the one known as Ājñātakauṇḍinya, mounted on a horse chariot, displayed a flash of lightning and brought down a gentle rain.

source: དེ་ལྟ་བུའི་རང་གི་རྫུ་འཕྲུལ་རྣམ་པར་སྟོན་ཅིང་འོང་ངོ་། །
en: Thus demonstrating his miraculous power, he made his entrance.

source: དེ་ནས་མ་ག་དྷཱ་བཟང་མོའི་བདག་པོས་དེ་མཐོང་བ་དང་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: Sumāgadhā’s master saw this and asked, “Sumāgadhā, is this your teacher?”

source: དེས་སྨྲས་པ། འདི་ནི་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: She replied, “This one is known as Ājñātakauṇḍinya.

source: འདི་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་དང་པོ་བསྐོར་བ་ན། འདིས་ཐོག་མར་བདག་མེད་པ་མངོན་སུམ་དུ་བྱས་པ་དེ་ཐོག་མར་འོངས་པ་འདི་ཡིན་ནོ། །
en: He is arriving first since he was the first to realize that there is no self after the Blessed One first turned the wheel of Dharma.”

source: བར་སྐབས་དེར་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་བྲག་གི་རི་ཆེན་པོ་ཤིང་སྣ་ཚོགས་པ་རྣམ་པ་བརྒྱས་ཁྱབ་པ་བྱ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཁྱབ་པ། མེ་ཏོག་སྣ་ཚོགས་པས་ཡང་དག་པར་ཁེབས་པ། གཡའ་ཆུ་སྣ་ཚོགས་ཀྱིས་ཉེ་བར་མཛེས་པར་བྱས་པ་མངོན་པར་སྤྲུལ་ཏེ་སྟེང་གི་ནམ་མཁའ་ལས་འོང་ངོ་། །
en: Then the elder Mahākāśyapa made his entrance from the sky above, having magically created a great rocky mountain covered with hundreds of variegated trees and various forms of birds, lushly carpeted with a diversity of flowers, and beautified by manifold rivulets.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དེ་མཐོང་ནས་སྨྲས་པ། མ་ག་དྷཱ་བཟང་མོ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house saw that and asked, “Sumāgadhā, is this your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་འོད་སྲུང་ཆེན་པོ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: She replied, “This one who now arrives is known as Mahākāśyapa.

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྦྱངས་པའི་ཡོན་ཏན་ལ་གནས་པར་སྨྲ་བ་རྣམས་ཀྱི་མཆོག་ཏུ་གསུངས་པ་སྟེ།
en: The Blessed One pronounced him chief among the preachers for his abiding in ascetic practices.

source: འདིས་གཅིག་གིས་མ་ཚང་བའི་གླང་དོར་སྟོང་བོར་ཞིང་། སེར་སྐྱ་བཟང་མོ་སྐྱེ་བོ་དགེ་བ་རྣམས་དང་མཚུངས་པ་དང་། དབྱིག་དང་གསེར་མང་པོ་མཆིལ་མའི་ཐལ་བ་བཞིན་སྤངས་ནས་མངོན་པར་བྱུང་སྟེ་རབ་ཏུ་བྱུང་བ་དེ་ནི་འོང་བ་འདི་ཡིན་ནོ། །
en: He gave up nine hundred ninety-nine pairs of oxen and abandoned, like spittle in the dust, Kapilabhadrā, the most beautiful woman in the land, and great wealth and much gold, and went forth and became a renunciant.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སེང་གེའི་ཤིང་རྟ་མངོན་པར་སྤྲུལ་ཏེ། སྟེང་གི་ནམ་མཁའ་ལ་རྫུ་འཕྲུལ་གྱིས་འོང་ངོ་། །
en: Next, the venerable Śāriputra, having magically created a lion chariot, made his entrance in the sky above using his miraculous power.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དེ་མཐོང་བ་དང་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་གང་སེང་གེའི་ཤིང་རྟས་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house saw that and asked, “Sumāgadhā, is this one who arrives in a lion chariot your teacher?”

source: དེ་ནས་དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: She replied, “This is the monk known as Śāriputra.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཤེས་རབ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ཡིན་ཏེ།
en: The Blessed One pronounced him chief among those endowed with wisdom.

source: འདི་མའི་མངལ་དུ་ཞུགས་པ་ཙམ་གྱིས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱི་རྩོད་པར་སྨྲ་བ་རྣམས་ལས་རྒྱལ་བར་གྱུར་ཏོ། །
en: As soon as he entered his mother’s womb, he was victorious over all those who engage in of debate throughout the entire world.

source: འདི་ནི་སྟོན་པ་གཉིས་པ། མཆོག་གཉིས་པ། ཆོས་ཀྱི་སྡེ་དཔོན། ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སུ་སྐོར་བ་དེ་ནི་སེང་གེའི་ཤིང་རྟས་འོངས་པ་འདི་ཡིན་ནོ། །
en: He who arrives in the lion chariot is the second teacher, the second supreme one, the Dharma chief who subsequently turns the wheel of Dharma.”

source: དེའི་རྗེས་ཐོགས་ཉིད་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་གླང་པོ་ཆེ་ས་སྲུང་འདྲ་བའི་གླང་པོའི་རྒྱལ་པོ་མངོན་པར་སྤྲུལ་ཏེ། སྟེང་གི་ནམ་མཁའ་ལ་རྫུ་འཕྲུལ་གྱིས་འོང་ངོ་། །
en: Right after that, the venerable Mahāmaudgalyāyana, having magically created a king of elephants that was like the elephant Airāvaṇa, made his entrance in the sky above using his miraculous power.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དེ་མཐོང་ནས། མ་ག་དྷཱ་བཟང་མོ་ལ་དྲིས་པ། གང་གླང་པོའི་རྒྱལ་པོ་ས་སྲུང་འདྲ་བའི་གླང་པོས་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house saw that and asked Sumāgadhā, “Is this one who arrives on an elephant that is like Airāvaṇa, the king of elephants, your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: She replied, “This is the monk known as Mahāmaudgalyāyana.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་སྟེ།
en: The Blessed One pronounced him chief among those with miraculous power.

source: འདིའི་རྫུ་འཕྲུལ་གྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་རྣམ་པར་རྒྱལ་བའི་ཁང་བཟངས་རྐང་པའི་མཐེ་བོས་ཀུན་དུ་སྒུལ་བ་དང་།
en: With his miraculous power, he shook Vaijayanta, the mansion of Śakra, the lord of the gods, with his big toe, and he tamed the nāga kings Nanda and Upananda.

source: འདིས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་གཉིས་བཏུལ་བ་དེ་གླང་པོའི་ཤིང་རྟས་འོང་བ་འདི་ཡིན་ནོ། །
en: It is he who arrives on an elephant chariot.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཤིང་རྟའི་འཕང་ལོ་ཙམ་གྱི་པད་མ་ཐམས་ཅད་གསེར་ལས་བྱས་པ། བཻ་དཱུརྱའི་སྡོང་བུ་ཅན་དངུལ་གྱི་གེ་སར་དང་ལྡན་པ་མངོན་པར་སྤྲུལ་ཏེ། རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལས་འོང་ངོ་། །
en: Next, the venerable Aniruddha made his entrance from the sky using his miraculous power, having magically created a lotus the size of a chariot wheel and made entirely of gold, with a stem of beryl and a stamen of silver.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དེ་མཐོང་བ་དང་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: Seeing that, the master of the house asked, “Sumāgadhā, is this your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་མ་འགགས་པ་ཞེས་བྱ་བ།
en: She replied, “This one is the monk known as Aniruddha.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་མིག་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་སྟེ།
en: The Blessed One pronounced him chief among those possessed of the divine eye.

source: འདི་ནི་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱིས་ཡོངས་སུ་བཟུང་བས་སྣོད་ཚོས་པས་གང་བ་ལྔ་བརྒྱ་སྒོ་ན་གནས་པ་དང་།
en: He conducts himself such that by the power of his merit five hundred vessels filled with cooked food arrive at his door by merely thinking of them.

source: ཅུང་ཟད་བསམས་པ་ཙམ་གྱིས་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་སྟན་དང་། ནད་ཀྱི་རྐྱེན་སྨན་དང་།
en: At the slightest thought, robes, alms, food, bedding, medicines for illness, and all necessities arise.

source: ཡོ་བྱད་རྣམས་འབྱུང་བ་ལ་སྤྱོད་པ་དེ་པད་མའི་ཤིང་རྟས་འོང་བ་འདི་ཡིན་ནོ། །
en: It is he who arrives on a lotus chariot.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་གང་པོས་ནམ་མཁའ་ལྡིང་གི་ཤིང་རྟ་མངོན་པར་སྤྲུལ་ཏེ། རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་ནམ་མཁའ་ལས་འོང་ངོ་། །
en: Then the venerable Pūrṇa made his entrance from the sky above, having magically created a garuḍa chariot.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དྲིས་པ་མ་ག་དྷཱ་བཟང་མོ་ནམ་མཁའ་ལྡིང་གི་ཤིང་རྟས་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ། དེས་དེ་ལ་སྨྲས་པ།
en: The master of the house asked, “Sumāgadhā, is the one arriving on a garuḍa chariot your teacher?”

source: འདི་ནི་དགེ་སློང་གང་པོ་ཞེས་བྱ་བ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་སྟོན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་ནམ་མཁའ་ལྡིང་གི་ཤིང་རྟས་འོང་བ་འདི་ཡིན་ནོ། །
en: She replied, “This one is the monk known as Pūrṇa. The Blessed One pronounced him chief among the teachers of Dharma. It is he who arrives on a garuḍa chariot.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བས་འོང་ངོ་། །
en: Next, the venerable Aśvajit made his entrance in an extremely peaceful manner.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དེ་ལ་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་གང་ལྷུང་བཟེད་ལག་ན་ཐོགས་ཏེ་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བས་འོང་བ་དེ་ཁྱོད་ཀྱི་སྟོན་པ་ཡིན་ནམ།
en: The master of the house asked, “Sumāgadhā, is this one who arrives in such a tranquil manner, holding an alms bowl, your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་རྟ་ཐུལ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: She replied, “This is the monk known as Aśvajit.

source: འདིའི་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བས་གླང་པོ་ཆེ་སྨྱོན་པ་བཏུལ་བ་དང་།
en: With his tranquil manner, he tamed a mad elephant.

source: འདིའི་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་མཐོང་བས་འཕགས་པ་ཤཱ་རིའི་བུས་བདེན་པ་མཐོང་བར་གྱུར་ཏེ། དེ་མངོན་པར་བྱུང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: Seeing his tranquil manner, the noble Śāriputra saw the truth, went forth and became a renunciant in the teaching of the Blessed One, and, having become a renunciant, attained arhathood.

source: རབ་ཏུ་བྱུང་ནས་ཀྱང་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པ་དེ་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བས་འོང་བ་འདི་ཡིན་ནོ། །
en: It is he who arrives in a tranquil manner.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་གསེར་གྱི་ཏ་ལའི་ནགས་མངོན་པར་སྤྲུལ་ཏེ། རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་ནམ་མཁའ་ལས་འོང་ངོ་། །
en: Then the venerable Upāli made his entrance from the sky above using his miraculous power, having magically created a forest of golden palm trees.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དེ་ལ་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་གང་གསེར་གྱི་ཏ་ལའི་ནགས་ལ་རྟེན་ཅིང་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house asked, “Sumāgadhā, is this one who arrives in a forest of golden palm trees your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་ཉེ་བར་འཁོར་ཞེས་བྱ་བ་བཅོམ་ལྡན་འདས་ཀྱིས་འདུལ་བ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ཡིན་ཏེ།
en: She replied, “This is the monk known as Upāli. The Blessed One pronounced him chief among the holders of the Vinaya.

source: འདི་ལ་ཤཱཀྱ་ལྔ་བརྒྱ་ཙམ་རབ་ཏུ་བྱུང་བ་རྣམས་ཀྱིས་དོ་ཤལ་དང་། གདུ་བུ་དང་། དཔུང་རྒྱན་དང་། གསེར་གྱི་གདུགས་ལ་སོགས་པའི་རྒྱན་རྣམས་དང་། གོས་རྣམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་མདུན་དུ་བཞག་པ་དང་།
en: As many as five hundred Śākya renunciants placed a great heap of ornaments such as necklaces, bracelets, armlets, golden parasols, and garments in front of him.

source: འདིས་དེ་མཐོང་བ་དང་སྐྱོ་བ་ཆེན་པོ་སྐྱེས་ཏེ།
en: When he saw them, he felt a great revulsion.

source: དེ་དག་ཐམས་ཅད་མི་རྟག་པར་ཤེས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: Understanding them all to be impermanent, he became a renunciant in the teaching of the Buddha, and, having become a renunciant, he realized the state of an arhat.

source: རབ་ཏུ་བྱུང་ནས་ཀྱང་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་པ་དེ་གསེར་གྱི་ཏ་ལའི་ནགས་ལ་རྟེན་ནས་འོང་བ་འདི་ཡིན་ནོ། །
en: It is he who arrives in a forest of golden palm trees.”

source: དེ་ནས་བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུ་ཆེན་པོས་བཻ་དཱུརྱའི་ཁང་པ་བརྩེགས་པ་མངོན་པར་སྤྲུལ་ཏེ། རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལས་འོང་ངོ་། །
en: Next, the venerable Mahākātyāyanaputra made his entrance from the sky using his miraculous power, having magically created a pinnacled temple made of beryl.
